Repository: rinrinne/IDEA_resources_jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Usage: {0} diff <left file> <right file> [<base file>]
ja: 使用方法 : {0} diff <左ファイル> <右ファイル> [<ベースファイル>]

source: Usage: {0} merge <left file> <right file> [<base file>] <output file>
ja: 使用方法: {0} merge <左ファイル> <右ファイル> [<ベースファイル>] <出力ファイル>

source: Usages
ja: 使用箇所

source: Usages of &fields
ja: フィールドの使用箇所(&F)

source: Usages of &methods
ja: メソッドの使用箇所(&M)

source: Usages of API documented as @since 1.5 (1.6|1.7)
ja: @since 1.5(1.6|1.7)で文書化された API の使用方法

source: Usages of {0} {1} not found
ja: {0} {1} の使用箇所は見つかりません

source: Use "CamelHumps" words
ja: "キャメル ケース" を使用する

source: Use @throws rather than @exception
ja: @exception の代わりに @throws を使用する

source: Use Introduce Variable to quickly declare variables
ja: 迅速な変数宣言のために変数の導入を使用する

source: Use JDK definitions from project files
ja: プロジェクト ファイルからの JSDK 定義を使用する

source: Use alternative &JRE:
ja: 代替 JRE の使用(&J):

source: Use anti-aliased font
ja: アンチエイリアス フォントをエディタに使用する

source: Use block caret
ja: ブロックキャレットを使用する

source: Use c&ustom Ant:
ja: カスタム Ant を使用する(&U)

source: Use check boxes in the inspection options below, to define rules for the modifier change suggestions.
ja: 修飾子変更を提案するルールを定義するには、以下の検査オプションのチェック ボックスを使用します。

source: Use check boxes in the inspection options below, to define which declarations are to be reported.
ja: 報告する宣言を定義するには、以下の検査オプションのチェック ボックスを使用します。

source: Use checkboxes in the inspection options below, to define whether parameters or local variables (or both) are to be reported.
ja: 報告するパラメータまたはローカル変数 (または両方) を定義するには、以下の検査オプションのチェック ボックスを使用します。

source: Use default renderer
ja: デフォルトのレンダラを使用する

source: Use external tool to compare files:
ja: 外部ツールでファイルを比較する:

source: Use external tool to compare folders:
ja: 外部ツールでフォルダを比較する:

source: Use following expression:
ja: 次の式を使用する:

source: Use fully qualified class names
ja: 完全修飾クラス名を使用する

source: Use fully qualified class names in JavaDoc:
ja: javadoc で完全修飾クラス名を使用する:

source: Use fully qualified class names in javadoc
ja: javadoc で完全修飾クラス名を使用する

source: Use global code style
ja: グローバル コード スタイルを使用する

source: Use list of expressions:
ja: 式のリストを使用する:

source: Use per-project code style scheme
ja: プロジェクト単位のコード スタイル スキームを使用する

source: Use project &default Ant:
ja: プロジェクトのデフォルトの Ant を使用する(&D)

source: Use single class import
ja: シングル クラス インポートを使用する

source: Use tab character
ja: タブ文字を使用する

source: Use tabs and corresponding inspection options below, to define visibility scope where javadoc is required, as well as the required javadoc tags for classes, methods, fields and inner classes.
ja: javadoc が必要な可視性範囲、クラス、メソッド、フィールド、および内部クラスの必要な javadoc タグを定義するには、以下のタブおよび対応するオプションを使用します。

source: Use the "Configure dependency rules" button below to customize validation rules.
ja: 検証ルールをカスタマイズするには、[依存関係ルールの設定] ボタンを押します

source: Use transparent mode for floating windows
ja: フローティング ウィンドウに透過モードを使用する

source: User task
ja: ユーザー タスク

source: Using camel words prefixes in navigation popups
ja: ナビゲーション ポップアップで キャメル ケース を使用する

source: Using wildcards in go to class, file or symbol
ja: クラス、ファイル、またはシンボルへの移動ではワイルドカードを使用する

source: VM Version Warning
ja: VM バージョンの警告

source: VM disconnected.
ja: VM は切断しました。

source: Valid string escape
ja: 適正な文字エスケープ

source: Value
ja: 値

source: Value:
ja: 値 :

source: Variable ''{0}'' is already declared
ja: 変数 ''{0}'' は既に宣言されています

source: Variable ''{0}'' is not declared
ja: 変数 ''{0}'' が宣言されていません

source: Variable <code>#ref</code> can have <code>final</code> modifier
ja: 変数 <code>\#ref</code> は <code>final</code> 修飾子を持てます。

source: Variable name completion
ja: 変数名の補完

source: Variable {0} initializer {1} is redundant
ja: 変数 {0} の初期化子 {1} は冗長です。

source: Variable {0} is never used
ja: 変数 {0} は使用されません。

source: Variables debug info not available
ja: ローカル変数デバッグ情報は利用できません

source: Variables used in the string concatenation, usually passed as arguments to the internationalized expression.
ja: 文字列の結合に使用する変数であり、通常国際化された表現に対する引数として渡される。

source: Vendor
ja: ベンダ

source: Verbose or redundant code constructs
ja: 詳細または冗長なコード構成

source: Verification error : {0}
ja: 検証エラー : {0}

source: Version Control Systems
ja: バージョン管理システム

source: View Breakpoints
ja: ブレークポイントを見る

source: Virtual Space
ja: 仮想スペース

source: Visibility issues
ja: 可視性問題

source: W&hole project
ja: プロジェクト全体(&P)

source: WARNING
ja: 警告

source: Waiting until last debugger command completes
ja: 最後のデバッガ コマンドが終了するまで待機しています

source: Warning
ja: 警告

source: Warning : {0}
ja: 警告: {0}

source: Watch
ja: ウォッチ

source: Watches ({0})
ja: ウォッチ({0})

source: We recommend using J2SDK 1.4.0_01 or higher.
ja: J2SDK 1.4.0_01 またはそれ以上のバージョンを推奨します。

source: Web Browser
ja: Web ブラウザ

source: When closing active editor:
ja: アクティブなエディタを閉じるとき :

source: When expanding a node
ja: ノードを展開するとき

source: When rendering a node
ja: ノードをレンダリングするとき

source: Whole wo&rds only (may be faster)
ja: 完全一致(&W)

source: Window Options
ja: ウィンドウ オプション

source: With Subpackages
ja: サブパッケージを含む

source: Would you like to download and install plugin ''{0}''?
ja: プラグイン "{0}" のダウンロードとインストールを行いますか ?

source: Would you like to mark the module content root "{0}" as a source directory?
ja: モジュール コンテント ルート "{0}" をソース ディレクトリとしてマークしますか ?

source: Would you like to overwrite it?
ja: 上書きしますか ?

source: Would you like to re-activate or shut down?
ja: このコンピュータで再アクティベートしますか ?

source: Would you like to stop the search?
ja: 検索を中止しますか ?

source: Would you like to update plugin ''{0}''?
ja: プラグイン "{0}" をアップデートしますか ?

source: Wrap Expression
ja: 式の折り返し

source: Wrap at right margin
ja: 右余白で折り返す

source: Wrap at word breaks
ja: 単語の区切りで折り返す

source: Wrap attributes:
ja: 属性の折り返し :

source: Wrap text
ja: テキストを折り返す

source: Wrap using ''{0}''
ja: ''{0}'' を使用して折り返す

source: Wrapping
ja: 折り返し

source: Wrong name format: {0}
ja: 不正な名前のフォーマット : {0}

source: Wrong package statement
ja: 不正な package 文

source: XHTML files
ja: XHTML ファイル

source: XML Document Type Definition
ja: XML ドキュメント タイプ定義

source: XML entities
ja: XMLエンティティ

source: XML files
ja: XML ファイル

source: XML tag
ja: XMLタグ

source: XML tags
ja: XMLタグ

source: Yes for &All
ja: すべてはい(&A)

source: Yesterday
ja: 昨日

source: You already have the latest version of {0} installed.
ja: ご使用の {0}は最新バージョンです。

source: You are adding an action without icon to the toolbar.
ja: ツールバーへのアイコンを指定せずにアクションを追加しようとしています。

source: You can import settings using ''File|Import Settings''.
ja: 設定のインポートは [ファイル] - [設定のインポート] で行います。

source: You can import your settings from a previous version of {0}.
ja: IntelliJ IDEA の旧バージョン{0}から設定をインポートできます

source: You have selected current {0} installation home.
ja: 現在の {0} インストール ホームを選択しました。

source: You have to restart {0} to reload the settings.
ja: {0} を再起動して設定を読み込み直してください。

source: You might also need to modify template project settings.
ja: また、テンプレート プロジェクト設定を変更する必要があります。

source: You might not be able to fully undo this operation!
ja: この処理はやり直しできません。

source: Your settings have been successfully exported.
ja: 設定を正常にエクスポートしました。

source: [Duplicate]
ja: [重複]

source: [Invalid]
ja: [無効]

source: _Clear And Close
ja: クリアして閉じる(_C)

source: _Clear List
ja: リストのクリア(_C)

source: _Close
ja: 閉じる(_C)

source: _Delete
ja: 削除(_D)

source: _Delete...
ja: 削除(_D)...

source: _No
ja: いいえ(_N)

source: _Yes
ja: はい(_Y)

source: a super method call, for void methods - super.method_name(); with or without parameters; for other methods - return super.method_name(); with or without parameters
ja: スーパー メソッド呼び出し、void メソッドの場合 - super.メソッド名(); (パラメータあり/なし) 。他のメソッドの場合 - return super.メソッド名(); (パラメータあり/なし)

source: abstract\&nbsp;class
ja: Abstract\&nbsp;クラス

source: anonymous
ja: 匿名

source: anonymous ({0})
ja: 匿名 ({0})

source: anonymous class
ja: 匿名クラス

source: ant.jar not found in directory ''{0}''
ja: ant.jar がディレクトリ ''{0}'' に見つかりません

source: assert statements, like in assert str.equals("message")
ja: assert str.equals("メッセージ")のようなassert文

source: at {0}({1}:{2,number,#})
ja: 行 {0}({1}: {2,number,#})

source: attribute
ja: 属性

source: attribute value
ja: 属性値

source: blocks {0}
ja: ブロック{0}

source: build all
ja: すべてビルド

source: class
ja: クラス

source: cleanup all
ja: すべてクリーンアップ

source: cleanup module
ja: モジュールのクリーンアップ

source: compile {0,choice, 1#module|2#modules} {1}; test classes
ja: コンパイル {0,choice, 1\#module|2\#modules} {1}; テスト クラス

source: constructor
ja: コンストラクタ

source: current day of the month
ja: 今月の日

source: current hour
ja: 現時刻の時

source: current minute
ja: 現時刻の分

source: current month
ja: 現在の月

source: current system date
ja: 現在のシステム日付

source: current system time
ja: 現在のシステム時間

source: current user system login name
ja: 現在のユーザー (システム ログイン) 名

source: current year
ja: 現在の年

source: daemon
ja: デーモン

source: default package
ja: デフォルト パッケージ

source: deprecated list
ja: 非推奨リスト

source: description
ja: 説明

source: directory
ja: ディレクトリ

source: en&d index:
ja: 終了インデックス(&D):

source: entity
ja: エンティティ

source: equals() and hashCode() not paired
ja: equals() と hashCode() が組になっていません

source: equals() for nested arrays is not supported
ja: ネストされた配列 equals() はサポートされていません

source: exception
ja: 例外

source: exception constructor calls, like in new Exception("message")
ja: new Exception("メッセージ")のような例外コンストラクタ呼び出し

source: field
ja: フィールド

source: file
ja: ファイル

source: idle time: {0}
ja: アイドル時間 : {0}

source: implicit ant properties
ja: 暗黙的な ant プロパティ

source: implicit constructor of
ja: の暗黙的なコンストラクタ

source: implicit constructor of {0}
ja: {0} の暗黙的なコンストラクタ

source: in a few moments
ja: 少しの間

source: in group ''{0}''
ja: グループ ''{0}''

source: in {0,choice, 0#zero days|1#one day|2#{0,number} days}
ja: {0,choice, 0\#0 日間|1\#1 日間|2\#{0,number} 日間}

source: in {0,choice, 0#zero hours|1#one hour|2#{0,number} hours}
ja: {0,choice, 0\#0 時間|1\#1 時間|2\#{0,number} 時間}

source: in {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes}
ja: {0,choice, 0\#0 分間|1\#1 分間|2\#{0,number} 分間}

source: in {0,choice, 0#zero months|1#one month|2#{0,number} months}
ja: {0,choice, 0\#0 か月間|1\#1 か月間|2\#{0,number} か月間}

source: in {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks}
ja: {0,choice, 0\#0 週間|1\#1 週間|2\#{0,number} 週間}

source: in {0,choice, 0#zero years|1#one year|2#{0,number} years}
ja: {0,choice, 0\#0 年間|1\#1 年間|2\#{0,number} 年間}

source: initializer
ja: 初期化子

source: instance initializer
ja: インスタンス初期化子

source: interface
ja: インターフェイス

source: invalid
ja: 無効

source: javadoc exited with exit code $EXIT_CODE$
ja: javadoc は終了コード $EXIT_CODE$ で終了しました

source: junit.jar not found in module ''{0}'' class path.
ja: junit.jar がモジュール "{0}" クラス パスにありません。

source: label
ja: ラベル

source: less than 1 day
ja: 1 日未満

source: less than a minute
ja: 1 分未満

source: lib directory not found in {0}
ja: lib ディレクトリが {0} に見つかりません

source: line ({0})
ja: 行 ({0})

source: lines
ja: 行

source: literals with value of legal and existing class name like Class.forName("java.lang.Object");
ja: Class.forName("java.lang.Object");のような正式な既存のクラス名の値を含むリテラル

source: literals with value of legal and existing property key bundle.getString("authentication.failed");
ja: bundle.getString("authentication.failed");のような正式な既存のプロパティキーの値を含むリテラル

source: loading
ja: 読み込み中

source: loading...
ja: 読み込み中...

source: locked {0}
ja: {0}をロック

source: method
ja: メソッド

source: method is defined in the class
ja: メソッドはクラス内で定義されています

source: method is not defined in the class but defined in superclass
ja: メソッドはクラス内で定義されていませんが、スーパークラスで定義されています

source: method should be defined since the class is not abstract
ja: 抽象クラスではないため、メソッドを定義する必要があります

source: module ''{0}''
ja: モジュール ''{0}''

source: modules
ja: モジュール

source: moments ago
ja: 数分前

source: n/a
ja: 該当なし

source: name of the Exception variable specified as a catch parameter
ja: catch パラメータとして指定された Exception 変数の名前

source: name of the created method
ja: 作成したメソッドの名前

source: name of the method that is implemented
ja: 実装したメソッドの名前

source: name of the method that is overridden
ja: オーバーライドされたメソッドの名前

source: name of the package in which the new file is created
ja: 新規クラスが作成されたパッケージの名前

source: non-qualified name of the class where method is implemented
ja: メソッドが継承されたクラスの非修飾名

source: noname
ja: 名前なし

source: null context
ja: NULL コンテキスト

source: of class
ja: クラスの

source: of interface
ja: インターフェイスの

source: or if tag size more than
ja: またはタグが次のサイズ以上の場合 :

source: package
ja: パッケージ

source: parameter
ja: パラメータ

source: pos:{0}
ja: 位置 :{0}

source: prio={0}
ja: 優先度={0}

source: problem_class
ja: 問題のクラス(_C)

source: qualified name of the class where method is created
ja: メソッドが作成されたクラスの修飾名

source: qualified name of the class where method is implemented
ja: メソッドが実装されたクラスの修飾名

source: qualified name of the class where method is overridden
ja: メソッドがオーバーライドされたクラスの修飾名

source: return type of a created method
ja: 作成したメソッドの戻り型

source: right now
ja: 今すぐ

source: searching...
ja: 検索中...

source: sec.
ja: 秒。

source: shared memory
ja: 共有メモリ

source: socket
ja: ソケット

source: static initializer
ja: 静的初期化子

source: status: ''{0}''
ja: ステータス : ''{0}''

source: tag
ja: タグ

source: the name of the current project
ja: 現在のプロジェクト名

source: the only argument to a method returning String, like in getStringByKey("key")
ja: getStringByKey("キー")のような文字列を返すメソッドの唯一の引数

source: type of the catch parameter
ja: catchパラメータのタイプ

source: type parameter
ja: 型パラメータ

source: undefined
ja: 未定義

source: unknown
ja: 不明

source: unknown jsp
ja: 不明な jsp

source: unnamed
ja: 名前未設定

source: value returned by the method by default
ja: メソッドのデフォルトの戻り値

source: variable
ja: 変数

source: waiting for {0} to release lock on {1}
ja: {1}でのロックをリリースするまで{0} を待機

source: {0,choice, 0#zero days|1#one day|2#{0,number} days}
ja: {0,choice, 0\#0 日|1\#1 日|2\#{0,number} 日}

source: {0,choice, 0#zero days|1#one day|2#{0,number} days} ago
ja: {0,choice, 0\#0 日|1\#1 日|2\#{0,number} 日}前

source: {0,choice, 0#zero hours|1#one hour|2#{0,number} hours}
ja: {0,choice, 0\#0 時間|1\#1 時間|2\#{0,number} 時間}

source: {0,choice, 0#zero hours|1#one hour|2#{0,number} hours} ago
ja: {0,choice, 0\#0 時間|1\#1 時間|2\#{0,number} 時間}前

source: {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes}
ja: {0,choice, 0\#0 分|1\#1 分|2\#{0,number} 分}

source: {0,choice, 0#zero minutes|1#one minute|2#{0,number} minutes} ago
ja: {0,choice, 0\#0 分|1\#1 分|2\#{0,number} 分}前

source: {0,choice, 0#zero months|1#one month|2#{0,number} months}
ja: {0,choice, 0\#0 か月|1\#1 か月|2\#{0,number} か月}

source: {0,choice, 0#zero months|1#one month|2#{0,number} months} ago
ja: {0,choice, 0\#0 か月|1\#1 か月|2\#{0,number} か月}前

source: {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks}
ja: {0,choice, 0\#0 週間|1\#1 週間|2\#{0,number} 週間}

source: {0,choice, 0#zero weeks|1#one week|2#{0,number} weeks} ago
ja: {0,choice, 0\#0 週間|1\#1 週間|2\#{0,number} 週間}前

source: {0,choice, 0#zero years|1#one year|2#{0,number} years}
ja: {0,choice, 0\#0 年間|1\#1 年間|2\#{0,number} 年間}

source: {0,choice, 0#zero years|1#one year|2#{0,number} years} ago
ja: {0,choice, 0\#0 年|1\#1 年|2\#{0,number} 年}前

source: {0} (no items found)
ja: {0} (アイテムが見つかりません)

source: {0} Evaluation
ja: {0} 評価版

source: {0} class initializer
ja: {0} クラス初期化子

source: {0} contains read-only file(s).
ja: {0} には読み取り専用ファイルがあります。

source: {0} context configuration
ja: {0} コンテキスト設定

source: {0} days
ja: {0} 日

source: {0} does not appear to be {1} config folder or installation home
ja: {0} は {1} インストール ホームではありません

source: {0} does not exist.
ja: {0} は存在しません。

source: {0} failed to convert existing regular expression patterns: {1} Please enter pattern string in a new format.
ja: {0} は既存の正規表現パターンの変換に失敗しました: {1} 新しいフォーマットのパターン文字列を入力してください。

source: {0} folder already exists in {1}.
ja: フォルダ{0}は既に{1}に存在します。

source: {0} is currently searching for sources.
ja: {0} がソースを検索しています。

source: {0} is directory
ja: {0} はディレクトリです

source: {0} is not a directory!
ja: {0} はディレクトリではありません！

source: {0} isn''t inheritor of TestCase
ja: {0} はテストケースの継承者ではありません

source: {0} isn''t test class
ja: {0} はテスト クラスではありません

source: {0} library
ja: {0} ライブラリ

source: {0} location path should be absolute
ja: {0} 場所の指定は、絶対パスでなければなりません

source: {0} needs too much resources to perform requested operation.
ja: {0} に必要なリソースが大きすぎるため、要求された処理は実行できません。

source: {0} of annotation type {1}
ja: 注釈型 {1} の {0}

source: {0} of anonymous class
ja: 匿名クラスの {0}

source: {0} of class {1}
ja: クラス {1} の {0}

source: {0} of enum {1}
ja: enum {1} の {0}

source: {0} of interface {1}
ja: インターフェイス {1} の {0}

source: {0} of {1}
ja: {1} の {0}

source: {0} s
ja: {0} 秒

source: {0} test case(s)
ja: {0} テスト ケース

source: {0} uptime: {1}
ja: {0} 稼動時間 : {1}

source: {0} vs Editor
ja: {0} とエディタ

source: {0}"{1}" does not exist.
ja: {0}"{1}" 存在しません。

source: {0}, perform "Find Next" again to search from the top
ja: {0}、"次を検索" を再実行して最初から検索します

source: {0}, perform "Find Previous" again to search from the bottom
ja: {0}、"前を検索" を再実行して最後から検索します

source: {0}, press {1} to search from the bottom
ja: {0}、{1} を押して最後から検索します

source: {0}, press {1} to search from the top
ja: {0}、{1} を押して最初から検索します

source: {0}.{1} will be modified at {4}({5}:{6,number,#}).
ja: {0}.{1} を{4}({5}:{6,number,#})で変更します。

source: {0}Button{1} Click
ja: {0}ボタン{1} クリック

source: {0}Button{1} Double-Click
ja: {0}ボタン{1} ダブルクリック

source: {1} may become unresponsive or even fail with OutOfMemoryError if you continue.
ja: 続行すると、{1} は応答しないかメモリ不足エラーになる可能性があります。

source: - all implementations of interface method are empty OR
ja: - インターフェイス メソッドの実装がすべて空、または

source: - invalid or incomplete tag
ja: - タグが無効または不完全

source: - javadoc description is missing or incomplete
ja: - javadoc の説明がないか不完全

source: - method is empty OR
ja: - メソッドが空、または

source: - method is empty itself and is overridden only by empty methods
ja: - メソッドが空で空のメソッドのみにオーバーライドされる

source: - no javadoc where it is required
ja: - javadoc が必要な場所にない

source: - required tag is missing
ja: - 必要なタグがない

source: - the value is always overwritten with another assignment before the next variable read OR
ja: - 次の変数を読み込む前に別の代入により値が常に上書きされる、または

source: - the variable initializer is redundant (for one of the above two reasons) OR
ja: - 変数の初期化子が (上の 2 つの理由のいずれかにより) 冗長である、または

source: - the variable is never used.
ja: - 変数が使用されない

source: - the variable never gets read after assignment OR
ja: - 変数が代入後に読み込まれない、または
